# Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24
# Затем вывести информацию о сети и маске в таком формате

#!/usr/bin/env python3


ips, mask = input('Введите IP в формате (10.1.1.0/24): ').split('/')
lst = map(int, ips.split('.'))
form_ips = """Network:
{0:<8} {1:<8} {2:<8} {3:<8}
{0:08b} {1:08b} {2:08b} {3:08b}
"""
print('\n'+'-'*40)  # делаем разрыв визуальный между результатами
print(form_ips.format(*lst))
print('-'*40)  # делаем разрыв визуальный между результатами

form_mask = """Mask:
/{mask}
{0:<8} {1:<8} {2:<8} {3:<8}
{0:08b} {1:08b} {2:08b} {3:08b}
"""
print(form_mask.format(255, 255, 255, 0, mask=mask))